In [3]:
import pandas as pd
import seaborn as sns

print(pd.__version__)
print(sns.__version__)

2.2.2
0.13.2

In [5]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [6]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [9]:
iris.tail(10)

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [10]:
iris.shape

(150, 5)

In [12]:
iris.info()

# object 아직 확정되지 않은 데이터타입 -> 추후 category 등으로 변경 필요

# Non-Null null(결측치)가 아닌 개수

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [13]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [21]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [28]:
type(iris['species'].value_counts()) # type 확인 필요

pandas.core.series.Series

- Series 데이터 타입: https://pandas.pydata.org/docs/reference/api/pandas.Series.html

위에서 series 관련 메서드 사용할 수 있음

In [32]:
iris['species'].value_counts().index

Index(['setosa', 'versicolor', 'virginica'], dtype='object', name='species')

In [33]:
iris['species'].value_counts().array

<NumpyExtensionArray>
[np.int64(50), np.int64(50), np.int64(50)]
Length: 3, dtype: int64

In [34]:
iris['species'].value_counts().dtype

dtype('int64')

자료형(data type)  int는 이 데이터가 정수형의미이며, 뒤의 숫자는 데이터를 표현하기 위해 사용하는 저장 공간의 크기(bit)

In [35]:
iris['species'].value_counts().nbytes

24

In [36]:
iris['species'].value_counts().ndim

1

In [37]:
iris['species'].value_counts().size

3

In [40]:
df = iris.drop("species", axis=1)
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [42]:
iris.shape, df.shape # iris 필드 개수, df의 필드 개수

((150, 5), (150, 4))

In [44]:
df2 = iris.drop(['sepal_length', 'sepal_width'], axis=1)
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [45]:
iris.shape, df.shape, df2.shape

((150, 5), (150, 4), (150, 3))

In [53]:
df3 = iris.drop([0, 1, 2], axis=0).reset_index(drop=True) # .reset_index(drop=True)를 꼭 해줘야함!
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [54]:
iris.shape, df.shape, df2.shape, df3.shape

((150, 5), (150, 4), (150, 3), (147, 5))

# 파일 입출력

## 파일 내보내기

In [55]:
iris.to_csv("iris.csv")

In [56]:
iris.to_csv("iris2.csv", index=False) # index=False 해줘야 넘버링되는 컬럼은 없이 불러와짐

In [57]:
iris.to_csv("./test_data/iris.csv", index=False)

iris.to_csv("../test_data/iris.csv", index=False) # 만약 위 모드에서 에러날 경우, '..'를 통해 상위폴더로 지정

## 파일 불러오기

In [58]:
iris_df = pd.read_csv("./test_data/iris.csv")
iris_df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [70]:
DATA_PATH = './kaggle/' # csv에서 copy path 함

train = pd.read_csv(DATA_PATH + 'test.csv')
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228

In [71]:
submission = pd.read_csv(DATA_PATH + 'sample_submission.csv')
submission.head(1)

         id  Response
0  11504798       0.5

## iloc vs loc 차이
- 강사 왈: 일단은 loc만 기억하자!! (이유: 직관적임)

In [76]:
# iris.loc[행, 열]

iris.loc[:, ['sepal_length', 'species']].head(1)

   sepal_length species
0           5.1  setosa

In [77]:
cols = ['sepal_length', 'species']
iris.loc[:, cols].head(1)

   sepal_length species
0           5.1  setosa

In [99]:
cols = ['sepal_length', 'species', 'petal_length'] # 추출할 컬럼명 지정
iris.loc[iris['petal_length'] >= 1.0, cols].head(5)

   sepal_length species  petal_length
0           5.1  setosa           1.4
1           4.9  setosa           1.4
2           4.7  setosa           1.3
3           4.6  setosa           1.5
4           5.0  setosa           1.4

## 문제1. 
- petal_length가 1.7 이상 인 값을 조회하고, 필드명은 sepal_width, petal_length만 추출하세요

In [103]:
cols2 = ['sepal_width', 'petal_length'] # 추출할 컬럼명 지정
result = iris.loc[iris['petal_length'] >= 1.7, cols2].reset_index(drop=True) # reset_index(drop=True) 넘버링 0번부터 시작
result

     sepal_width  petal_length
0            3.9           1.7
1            3.8           1.7
2            3.4           1.7
3            3.3           1.7
4            3.4           1.9
..           ...           ...
101          3.0           5.2
102          2.5           5.0
103          3.0           5.2
104          3.4           5.4
105          3.0           5.1

[106 rows x 2 columns]

## 다중조건
- AND 연산자: 교집합, &
- OR 연산자: 합집합, |

In [108]:
result1 = iris.loc[iris['species'] == 'setosa']
result2 = result1.loc[iris['petal_length'] <= 5.1]
result2.shape

(50, 5)

In [106]:
result1.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [112]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(iris['species'] == 'setosa') & 
                (iris['petal_length'] <= 5.1), cols].reset_index(drop=True)
result.shape

(50, 2)

In [113]:
train.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228
1,11504799,Male,47,1,28.0,0,1-2 Year,Yes,37483.0,124.0,123
2,11504800,Male,47,1,43.0,0,1-2 Year,Yes,2630.0,26.0,271
3,11504801,Female,22,1,47.0,1,< 1 Year,No,24502.0,152.0,115
4,11504802,Male,51,1,19.0,0,1-2 Year,No,34115.0,124.0,148

### 테스트 1.
- Gender가 Male 인 것만 조회하고, 전체 행의 갯수는?

In [125]:
train.shape

(7669866, 11)

In [126]:
train.loc[:, :].head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228
1,11504799,Male,47,1,28.0,0,1-2 Year,Yes,37483.0,124.0,123
2,11504800,Male,47,1,43.0,0,1-2 Year,Yes,2630.0,26.0,271
3,11504801,Female,22,1,47.0,1,< 1 Year,No,24502.0,152.0,115
4,11504802,Male,51,1,19.0,0,1-2 Year,No,34115.0,124.0,148

In [127]:
male = train.loc[train['Gender'] == 'Male',:] # train.loc[행, 열] -> train.loc[:, :].head(1)
male.shape

(4151402, 11)

In [128]:
# 데이터프레임 -> tuple -> int

train.loc[train['Gender'] == 'Male',:].shape[0]

4151402

## 문제 2.

In [132]:
train['Vehicle_Age'].value_counts()

# Vehicle_Age 가 1-2 year과 <1 year 만 추출
# isin() 연산자 활용

Vehicle_Age
1-2 Year     3989276
< 1 Year     3361255
> 2 Years     319335
Name: count, dtype: int64

In [151]:
under_2 = train.loc[train['Vehicle_Age'] != '> 2 Years',:]
under_2

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228
1,11504799,Male,47,1,28.0,0,1-2 Year,Yes,37483.0,124.0,123
2,11504800,Male,47,1,43.0,0,1-2 Year,Yes,2630.0,26.0,271
3,11504801,Female,22,1,47.0,1,< 1 Year,No,24502.0,152.0,115
4,11504802,Male,51,1,19.0,0,1-2 Year,No,34115.0,124.0,148
...,...,...,...,...,...,...,...,...,...,...,...
7669861,19174659,Male,57,1,28.0,0,1-2 Year,Yes,51661.0,124.0,109
7669862,19174660,Male,28,1,50.0,1,< 1 Year,No,25651.0,152.0,184
7669863,19174661,Male,47,1,33.0,1,1-2 Year,No,2630.0,138.0,63
7669864,19174662,Male,30,1,28.0,0,< 1 Year,Yes,38866.0,124.0,119
7669865,19174663,Male,23,1,46.0,1,< 1 Year,No,27498.0,152.0,79

In [143]:
# isin() 활용 시,
s = pd.Series(['llama', 'cow', 'llama', 'beetle', 'llama',
               'hippo'], name='animal')
s.value_counts()

animal
llama     3
cow       1
beetle    1
hippo     1
Name: count, dtype: int64

In [142]:
s.isin(['cow', 'llma'])

0    False
1     True
2    False
3    False
4    False
5    False
Name: animal, dtype: bool

In [149]:
Vehicle_Age_Values = ['1-2 Year', '< 1 Year']
train.loc[train['Vehicle_Age'].isin(Vehicle_Age_Values),:].shape

(7350531, 11)